//=============================================================================
//
// ブロックリスト処理 [BlockList.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _BLOCKLIST_H_
#define _BLOCKLIST_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "BlockManager.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPlayer;
class CBlock;


//*****************************************************************************
// 壁ブロッククラス
//*****************************************************************************
class CWallBlock : public CBlock
{
public:
	CWallBlock();
	~CWallBlock();

	void Update(void);

private:
	static constexpr float resetDepth	= -810.0f;	// 位置リセットするZ位置
	static constexpr float bottomPosZ	= 540.0f;	// リセット位置
	static constexpr float moveSpeed	= 3.0f;		// 移動スピード

};

#endif
