//=============================================================================
//
// ブロックリスト処理 [BlockList.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "BlockList.h"
#include "Player.h"
#include "Game.h"
#include "Manager.h"
#include "algorithm"
#include "Motion.h"
#include "Time.h"
#include "Tutorial.h"
#include "Easing.h"
#include "CharacterManager.h"
#include "MathConst.h"


//=============================================================================
// 壁ブロックのコンストラクタ
//=============================================================================
CWallBlock::CWallBlock()
{
	// 値のクリア

}
//=============================================================================
// 壁ブロックのデストラクタ
//=============================================================================
CWallBlock::~CWallBlock()
{
	// なし
}
//=============================================================================
// 壁ブロックの更新処理
//=============================================================================
void CWallBlock::Update(void)
{
	// ブロックの更新処理
	CBlock::Update();

	if (CManager::GetMode() != CScene::MODE_RESULT)
	{
		return;
	}

	// 位置取得
	D3DXVECTOR3 pos = GetPos();

	// 奥(Z-方向)へ移動
	pos.z -= moveSpeed;

	// 一定の奥行きを超えたら(小さくなったら)手前に戻す
	if (pos.z <= resetDepth)
	{
		pos.z = bottomPosZ;
	}

	// 位置反映
	SetPos(pos);
}